; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v4 ?v9)
             (pred_12 ?v13 ?v6)
             (pred_11 ?v4 ?v6)
             (pred_7 ?v7 ?v4 )
	     (pred_8 ?v4)
             (pred_2 ?v2)
             (pred_5 ?v13)
             (pred_1 ?v6)
             (pred_6 ?v4)
             (pred_3 ?v13)
             (pred_9 ?v4)
             (pred_4 ))



(:action op_5
:parameters (?v1 ?v5 ?v11 ?v12)
:precondition (and (pred_2 ?v1) (pred_2 ?v5) (pred_5 ?v11) (pred_1 ?v12)
          (pred_10 ?v1 ?v5) (pred_12 ?v11 ?v12)
                   (pred_11 ?v5 ?v12) (pred_8 ?v1) 
                   (pred_6 ?v5) (pred_3 ?v11))
:effect (and  (pred_9 ?v5) (not (pred_6 ?v5))))


(:action op_1
:parameters (?v1 ?v10)
:precondition (and (pred_2 ?v1) (pred_2 ?v10)
               (pred_8 ?v1) (pred_10 ?v1 ?v10) (pred_9 ?v10))
:effect (and (pred_8 ?v10) (not (pred_8 ?v1))))

(:action op_3
:parameters (?v1 ?v11)
:precondition (and (pred_2 ?v1) (pred_5 ?v11) 
                  (pred_8 ?v1) (pred_7 ?v11 ?v1) (pred_4 ))
:effect (and (pred_3 ?v11)
   (not (pred_7 ?v11 ?v1)) (not (pred_4 ))))


(:action op_2
:parameters (?v1 ?v8 ?v3)
:precondition (and (pred_2 ?v1) (pred_5 ?v8) (pred_5 ?v3)
                  (pred_8 ?v1) (pred_3 ?v3) (pred_7 ?v8 ?v1))
:effect (and (pred_3 ?v8) (pred_7 ?v3 ?v1)
        (not (pred_3 ?v3)) (not (pred_7 ?v8 ?v1))))

(:action op_4
:parameters (?v1 ?v11)
:precondition (and (pred_2 ?v1) (pred_5 ?v11) 
                  (pred_8 ?v1) (pred_3 ?v11))
:effect (and (pred_4 ) (pred_7 ?v11 ?v1) (not (pred_3 ?v11)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_08 obj_07 obj_13 obj_20 obj_10 obj_06 obj_11 obj_01 obj_03 obj_18 obj_05 obj_12 obj_02 obj_17 obj_15 obj_09
    obj_21 obj_19 obj_22
    obj_14 obj_04 obj_16
    )

    (:init
       (pred_4)

       (pred_2 obj_08)
       (pred_2 obj_07)
       (pred_2 obj_13)
       (pred_2 obj_20)
       (pred_2 obj_10)
       (pred_2 obj_06)
       (pred_2 obj_11)
       (pred_2 obj_01)
       (pred_2 obj_03)
       (pred_2 obj_18)
       (pred_2 obj_05)
       (pred_2 obj_12)
       (pred_2 obj_02)
       (pred_2 obj_17)
       (pred_2 obj_15)
       (pred_2 obj_09)
       (pred_1 obj_21)
       (pred_1 obj_19)
       (pred_1 obj_22)
       (pred_5 obj_14)
       (pred_5 obj_04)
       (pred_5 obj_16)

       (pred_10 obj_08 obj_10)
       (pred_10 obj_08 obj_07)
       (pred_10 obj_07 obj_06)
       (pred_10 obj_07 obj_13)
       (pred_10 obj_07 obj_08)
       (pred_10 obj_13 obj_11)
       (pred_10 obj_13 obj_20)
       (pred_10 obj_13 obj_07)
       (pred_10 obj_20 obj_01)
       (pred_10 obj_20 obj_13)
       (pred_10 obj_10 obj_03)
       (pred_10 obj_10 obj_06)
       (pred_10 obj_10 obj_08)
       (pred_10 obj_06 obj_18)
       (pred_10 obj_06 obj_11)
       (pred_10 obj_06 obj_07)
       (pred_10 obj_06 obj_10)
       (pred_10 obj_11 obj_05)
       (pred_10 obj_11 obj_01)
       (pred_10 obj_11 obj_13)
       (pred_10 obj_11 obj_06)
       (pred_10 obj_01 obj_12)
       (pred_10 obj_01 obj_20)
       (pred_10 obj_01 obj_11)
       (pred_10 obj_03 obj_02)
       (pred_10 obj_03 obj_18)
       (pred_10 obj_03 obj_10)
       (pred_10 obj_18 obj_17)
       (pred_10 obj_18 obj_05)
       (pred_10 obj_18 obj_06)
       (pred_10 obj_18 obj_03)
       (pred_10 obj_05 obj_15)
       (pred_10 obj_05 obj_12)
       (pred_10 obj_05 obj_11)
       (pred_10 obj_05 obj_18)
       (pred_10 obj_12 obj_09)
       (pred_10 obj_12 obj_01)
       (pred_10 obj_12 obj_05)
       (pred_10 obj_02 obj_17)
       (pred_10 obj_02 obj_03)
       (pred_10 obj_17 obj_15)
       (pred_10 obj_17 obj_18)
       (pred_10 obj_17 obj_02)
       (pred_10 obj_15 obj_09)
       (pred_10 obj_15 obj_05)
       (pred_10 obj_15 obj_17)
       (pred_10 obj_09 obj_12)
       (pred_10 obj_09 obj_15)
       (pred_6 obj_11)
       (pred_6 obj_10)
       (pred_6 obj_09)
       (pred_11  obj_11 obj_21)
       (pred_11  obj_10 obj_19)
       (pred_11  obj_09 obj_22)
       (pred_9 obj_08)
       (pred_9 obj_07)
       (pred_9 obj_13)
       (pred_9 obj_20)
       (pred_9 obj_06)
       (pred_9 obj_01)
       (pred_9 obj_03)
       (pred_9 obj_18)
       (pred_9 obj_05)
       (pred_9 obj_12)
       (pred_9 obj_02)
       (pred_9 obj_17)
       (pred_9 obj_15)

       (pred_12  obj_14 obj_21)
       (pred_12  obj_04 obj_19)
       (pred_12  obj_16 obj_22)
       (pred_7 obj_14 obj_02)
       (pred_7 obj_04 obj_18)
       (pred_7 obj_16 obj_17)
       (pred_8 obj_06)
    )

    (:goal (and
       (pred_7 obj_04 obj_01)
    ))
(:constraints
  (always (not (pred_8 obj_05)))
)
)

; plan
1. (op_1 obj_06 obj_18)
   deleted: (pred_8 obj_06)
   added: (pred_8 obj_18)
   goals met: 0 of 1
2. (op_3 obj_18 obj_04)
   deleted: (pred_7 obj_04 obj_18) (pred_4)
   added: (pred_3 obj_04)
   goals met: 0 of 1
3. (op_1 obj_18 obj_06)
   deleted: (pred_8 obj_18)
   added: (pred_8 obj_06)
   goals met: 0 of 1
4. (op_1 obj_06 obj_07)
   deleted: (pred_8 obj_06)
   added: (pred_8 obj_07)
   goals met: 0 of 1
5. (op_1 obj_07 obj_13)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_13)
   goals met: 0 of 1
6. (op_1 obj_13 obj_20)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_20)
   goals met: 0 of 1
7. (op_1 obj_20 obj_01)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_01)
   goals met: 0 of 1
8. (op_4 obj_01 obj_04)
   deleted: (pred_3 obj_04)
   added: (pred_4) (pred_7 obj_04 obj_01)
   goals met: 1 of 1
